erp3l/src/Catalogs/ОбластиДанныхВидовОтчетов/ОбластиДанныхВидовОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбластиДанныхВидовОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>АналитикаОтбор</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>EnumRef.ТипыАналитикОбластиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики</name>
    <type>
      <types>EnumRef.ТипыАналитикОбластиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласование</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАналитики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборыАналитки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОбластьГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкОтображения</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВсеПоказателиВидаОтчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БланкиДляОтображения</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставОбласти</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СтрокиОтчетов/СтрокиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборотный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммироватьПодчиненные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодавлятьИерархиюПоПериодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСправочникаБД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ОбластиДанныхВидовОтчетов/Forms/ФормаВыбораСтрок/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ВидОтчета 	= Параметры.ВидОтчета;
	Область 	= Параметры.Область;
    Строки 		= Параметры.СписокСтрок; 
	ЗаполнитьДеревоСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСтрок()
	
	ДеревоНастройкиСервер=РеквизитФормыВЗначение("ДеревоНастройки");
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	СтрокиОтчетов.ПорядковыйНомер КАК ПорядковыйНомер,
	             |	СтрокаКолонка.Строка,
	             |	СтрокаКолонка.Код,
	             |	СтрокаКолонка.Наименование,
	             |	СтрокаКолонка.ГруппаРаскрытия,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики1 КАК ВидАналитики1,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики2 КАК ВидАналитики2,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики3 КАК ВидАналитики3,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики4 КАК ВидАналитики4,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики5 КАК ВидАналитики5,
				 |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики6 КАК ВидАналитики6,
	             |	СтрокаКолонка.ВидИтога,
	             |	СтрокаКолонка.ТипЗначения,
	             |	СтрокаКолонка.Родитель,
	             |	СтрокиОтчетов.СуммироватьПодчиненные,
	             |	СтрокаКолонка.СпособОбработки,
	             |	СтрокаКолонка.ВидКурса,
	             |	СтрокаКолонка.ВидПоказателя,
	             |	СтрокаКолонка.ДействияПриАктуализации,
	             |	СтрокаКолонка.Внутригрупповой,
	             |	СтрокаКолонка.Оборотный,
	             |	СтрокаКолонка.НеМасштабируется,
	             |	СтрокаКолонка.Наименование1,
	             |	СтрокаКолонка.Наименование2,
	             |	СтрокаКолонка.ПриходРасход,
	             |	СтрокаКолонка.ОценкаПоложительногоОтклонения,
	             |	СтрокаКолонка.СтатьяБюджета,
	             |	СтрокаКолонка.Предназначение,
	             |	СтрокаКолонка.РазделениеПоПроектам
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		СтрокиОтчетов.Ссылка КАК Строка,
	             |		СтрокиОтчетов.Код КАК Код,
	             |		СтрокиОтчетов.Наименование КАК Наименование,
	             |		СтрокиОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
	             |		СтрокиОтчетов.ПорядковыйНомер КАК ПорядковыйНомер,
	             |		СтрокиОтчетов.ВидИтога КАК ВидИтога,
	             |		СтрокиОтчетов.ТипЗначения КАК ТипЗначения,
	             |		СтрокиОтчетов.Родитель КАК Родитель,
	             |		СтрокиОтчетов.СпособОбработки КАК СпособОбработки,
	             |		СтрокиОтчетов.ВидКурса КАК ВидКурса,
	             |		СтрокиОтчетов.ВидПоказателя КАК ВидПоказателя,
	             |		СтрокиОтчетов.ДействияПриАктуализации КАК ДействияПриАктуализации,
	             |		СтрокиОтчетов.Внутригрупповой КАК Внутригрупповой,
	             |		СтрокиОтчетов.Оборотный КАК Оборотный,
	             |		СтрокиОтчетов.НеМасштабируется КАК НеМасштабируется,
	             |		СтрокиОтчетов.Наименование1 КАК Наименование1,
	             |		СтрокиОтчетов.Наименование2 КАК Наименование2,
	             |		СтрокиОтчетов.ПриходРасход КАК ПриходРасход,
	             |		ВЫБОР
	             |			КОГДА СтрокиОтчетов.Предназначение = ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств)
	             |				ТОГДА СтрокиОтчетов.СтатьяДвиженияДенежныхСредств
	             |			КОГДА СтрокиОтчетов.Предназначение = ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов)
	             |				ТОГДА СтрокиОтчетов.СтатьяДоходовИРасходов
	             |			КОГДА СтрокиОтчетов.Предназначение = ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияРесурсов)
	             |				ТОГДА СтрокиОтчетов.СтатьяДвиженияРесурсов
	             |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	             |		КОНЕЦ КАК СтатьяБюджета,
	             |		СтрокиОтчетов.ОценкаПоложительногоОтклонения КАК ОценкаПоложительногоОтклонения,
	             |		ВЫБОР
	             |			КОГДА СтрокиОтчетов.Предназначение = ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.ПустаяСсылка)
	             |				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.ПроизвольныеДанные)
	             |			ИНАЧЕ СтрокиОтчетов.Предназначение
	             |		КОНЕЦ КАК Предназначение,
	             |		СтрокиОтчетов.РазделениеПоПроектам КАК РазделениеПоПроектам
	             |	ИЗ
	             |		Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	             |	ГДЕ
	             |		СтрокиОтчетов.Владелец = &ВидОтчета
	             |		И НЕ СтрокиОтчетов.ПометкаУдаления) КАК СтрокаКолонка
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	             |		ПО СтрокаКолонка.Строка = СтрокиОтчетов.Ссылка
				 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСоставаОбластейВидовОтчетов КАК НастройкиСоставаОбластейВидовОтчетов
				 |		ПО СтрокаКолонка.Строка = НастройкиСоставаОбластейВидовОтчетов.Показатель
				 |			И (НастройкиСоставаОбластейВидовОтчетов.КлючОбласти <> &Область)
	             |ГДЕ
	             |	СтрокиОтчетов.Владелец = &ВидОтчета
	             |	И НЕ СтрокиОтчетов.ПометкаУдаления 	             
				 |
	             |УПОРЯДОЧИТЬ ПО
	             |	ПорядковыйНомер ИЕРАРХИЯ";
				 
	Запрос.УстановитьПараметр("ВидОтчета",ВидОтчета);
	Запрос.УстановитьПараметр("Область",Область);

	
	ВыводимаяСтрокаОтчета=Справочники.СтрокиОтчетов.ПустаяСсылка();
	ТекущаяСтрокаДерева=Неопределено;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	СоответствиеСтрок=Новый Соответствие;
	СоответствиеРодителей=Новый Соответствие;
	
	СписокАналитик=Новый Массив;
	
	ЕстьСтрокиБюджетов=Ложь;
	
	ДеревоНастройкиСервер_Строки = ДеревоНастройкиСервер.Строки.Добавить();
	ДеревоНастройкиСервер_Строки.Наименование = Нстр("ru = 'Доступные строки'");
	
	
	Пока Результат.Следующий() Цикл
		
		Если Результат.Строка<>ВыводимаяСтрокаОтчета Тогда
			
			ТекущаяСтрокаДерева=СоответствиеСтрок[Результат.Строка];
			
			Если ТекущаяСтрокаДерева=Неопределено Тогда
				
				Если Результат.Родитель=Справочники.СтрокиОтчетов.ПустаяСсылка() Тогда
					
					ТекущаяСтрокаДерева=ДеревоНастройкиСервер_Строки.Строки.Добавить();
					
				Иначе
					
					СтрокаРодитель=СоответствиеРодителей[Результат.Родитель];
					
					Если СтрокаРодитель=Неопределено Тогда
												
						СтрокаРодитель=ДеревоНастройкиСервер.Строки.Найти(Результат.Родитель,"Строка",Истина);
						СоответствиеРодителей.Вставить(Результат.Родитель,СтрокаРодитель);
						
					КонецЕсли;
					
					ТекущаяСтрокаДерева=СтрокаРодитель.Строки.Добавить();
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ТекущаяСтрокаДерева,Результат);
				ТекущаяСтрокаДерева.Код=СокрЛП(Результат.Код);
				СоответствиеСтрок.Вставить(Результат.Строка,ТекущаяСтрокаДерева);
				
			КонецЕсли;
			
			ВыводимаяСтрокаОтчета=Результат.Строка;
			
		КонецЕсли;
				
		Для Индекс=1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
			
			Если ЗначениеЗаполнено(ТекущаяСтрокаДерева["ВидАналитики"+Индекс]) И СписокАналитик.Найти("ДеревоНастройкиСтруктурыВидАналитики"+Индекс)=Неопределено Тогда
				
				СписокАналитик.Добавить("ДеревоНастройкиСтруктурыВидАналитики"+Индекс);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТекущаяСтрокаДерева.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств
			ИЛИ ТекущаяСтрокаДерева.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов
			ИЛИ ТекущаяСтрокаДерева.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияРесурсов Тогда
			
			ЕстьСтрокиБюджетов=Истина;
			
		КонецЕсли;

		Если НЕ Строки.НайтиПоЗначению(ТекущаяСтрокаДерева.Строка) = Неопределено Тогда
			 ТекущаяСтрокаДерева.Выбран = Истина;
		КонецЕсли;	
		
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоНастройкиСервер,"ДеревоНастройки");	
				
КонецПроцедуры // ЗаполнитьДеревоСтрок()

&НаКлиенте
Процедура Выбрать(Команда)
	
	СтруктураПараметров = ПолучитьВыбранныеСтроки();
	Закрыть(СтруктураПараметров);

КонецПроцедуры 

Функция  ПолучитьВыбранныеСтроки()
	
	ДеревоСтрок_ = РеквизитФормыВЗначение("ДеревоНастройки");
	СтруктураПараметров = Новый Структура;
	МассивВыбранных = Новый Массив;
	ПолучитьМассивВыбранныхРекурсивно(ДеревоСтрок_.Строки,МассивВыбранных);
	СтруктураПараметров.Вставить("ВыбранныеСтроки",МассивВыбранных);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура ПолучитьМассивВыбранныхРекурсивно(СтрокиДЗ,МассивВыбранных)
	
	Для Каждого СтрокаДерева Из СтрокиДЗ Цикл
		
		Если СтрокаДерева.Выбран И НЕ СокрЛП(СтрокаДерева.Наименование) = Нстр("ru = 'Доступные строки'") Тогда
			 МассивВыбранных.Добавить(СтрокаДерева.Строка);
		КонецЕсли;
				
		Если СтрокаДерева.Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолучитьМассивВыбранныхРекурсивно(СтрокаДерева.Строки,МассивВыбранных);
		
	КонецЦикла;
	
КонецПроцедуры
